salmanhabibie/claw/esp32s3-lcd-ai/sdkconfig.defaults
# ---- Target ----
CONFIG_IDF_TARGET="esp32s3"

# ---- Flash & PSRAM (ESP32-S3R8: 16 MB flash, 8 MB OCTAL PSRAM) ----
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# ---- Custom partition table (6 MB app) ----
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- Console over the native USB Serial/JTAG (single USB port on this board) ----
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# ---- HTTPS to api.anthropic.com using the bundled Mozilla root CAs ----
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# ---- Stacks: main task runs setup + the TLS speaker test, so give it room ----
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
